tap "aquasecurity/trivy"
tap "aws/tap"
tap "derailed/k9s"
tap "fairwindsops/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homeport/tap"
tap "kube-score/tap"
tap "minamijoyo/tfupdate"
tap "warrensbox/tap"
tap "ynqa/tap"
brew "act"
brew "ca-certificates"
brew "cryptography"
brew "python@3.12"
brew "ansible"
brew "awscli"
brew "bat"
brew "coreutils"
brew "cosign"
brew "direnv"
brew "perl"
brew "dpkg"
brew "node"
brew "fx"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gnu-sed"
brew "go"
brew "grep"
brew "hadolint"
brew "htop"
brew "httping"
brew "hub"
brew "jq"
brew "kind"
brew "kubeconform"
brew "kubectx"
brew "mise"
brew "nmap"
brew "peco"
brew "poetry"
brew "python@3.11"
brew "shellcheck"
brew "skaffold"
brew "sops"
brew "starship"
brew "tenv"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "yq"
brew "zsh"
brew "aquasecurity/trivy/trivy"
brew "aws/tap/eks-node-viewer"
brew "derailed/k9s/k9s"
brew "fairwindsops/tap/pluto"
brew "homeport/tap/dyff"
brew "kube-score/tap/kube-score"
brew "minamijoyo/tfupdate/tfupdate"
brew "ynqa/tap/jnv"
cask "aws-vault"
cask "dash@6"
cask "discord"
cask "dropbox"
cask "firefox"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "logi-options+"
cask "logitune"
cask "notion"
cask "postman"
cask "pycharm-ce"
cask "rancher"
cask "raycast"
cask "sequel-ace"
cask "session-manager-plugin"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "zoom"
