tap "derailed/k9s"
tap "fairwindsops/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "kube-score/tap"
tap "minamijoyo/tfupdate"
tap "warrensbox/tap"
brew "act"
brew "ca-certificates"
brew "openssl@1.1"
brew "ansible"
brew "awscli"
brew "bat"
brew "coreutils"
brew "direnv"
brew "fx"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gnu-sed"
brew "go"
brew "grep"
brew "hadolint"
brew "htop"
brew "httping"
brew "hub"
brew "jq"
brew "kind"
brew "kubeconform"
brew "kubeval"
brew "nmap"
brew "packer"
brew "perl"
brew "poetry"
brew "python@3.10"
brew "python@3.9"
brew "ruby"
brew "shellcheck"
brew "skaffold"
brew "sops"
brew "starship"
brew "tflint"
brew "tfsec"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "yq"
brew "zsh"
brew "derailed/k9s/k9s"
brew "fairwindsops/tap/pluto"
brew "kube-score/tap/kube-score"
brew "minamijoyo/tfupdate/tfupdate"
brew "warrensbox/tap/tfswitch"
cask "authy"
cask "aws-vault"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "fig"
cask "firefox"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "google-japanese-ime"
cask "gyazo"
cask "iterm2"
cask "kindle"
cask "logitech-options"
cask "notion"
cask "postman"
cask "pycharm-ce"
cask "raycast"
cask "sequel-pro"
cask "session-manager-plugin"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "zoom"
