tap "aquasecurity/trivy"
tap "aws/tap"
tap "datadog-labs/pack"
tap "derailed/k9s"
tap "fairwindsops/tap"
tap "homeport/tap"
tap "kube-score/tap"
tap "minamijoyo/tfupdate"
tap "oven-sh/bun"
tap "terraform-linters/tap"
tap "ynqa/tap"
# Run your GitHub Actions locally
brew "act"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Mozilla CA certificate store
brew "ca-certificates"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Highly capable, feature-rich programming language
brew "perl"
# Debian package management system
brew "dpkg"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Improved top (interactive process viewer)
brew "htop"
# Ping-like tool for HTTP requests
brew "httping"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Simple terminal UI for git commands
brew "lazygit"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Simplistic interactive filtering tool
brew "peco"
# Pins GitHub Actions to full hashes and versions
brew "pinact"
# Python package management tool
brew "poetry"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# OpenTofu / Terraform / Terragrunt / Terramate / Atmos version manager
brew "tenv"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Find security issues in GitHub Actions setups
brew "zizmor"
# UNIX shell (command interpreter)
brew "zsh"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy", trusted: true
# eks-node-viewer is a tool for visualizing dynamic node usage within an EKS cluster.
brew "aws/tap/eks-node-viewer", trusted: true
# Go-based command-line wrapper for easy interaction with Datadog APIs
brew "datadog-labs/pack/pup", trusted: true
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s", trusted: true
# Detect deprecated Kubernetes apiVersions
brew "fairwindsops/tap/pluto", trusted: true
# δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "homeport/tap/dyff", trusted: true
brew "kube-score/tap/kube-score", trusted: true
# Update version constraints in your Terraform / OpenTofu configurations
brew "minamijoyo/tfupdate/tfupdate", trusted: true
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun", trusted: true
# JSON navigator and interactive filter leveraging jq
brew "ynqa/tap/jnv", trusted: true
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# API documentation browser and code snippet manager
cask "dash@6"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Japanese input software
cask "google-japanese-ime"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logi-options+"
# Optimise your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# App to write, plan, collaborate, and get organised
cask "notion"
# Collaboration platform for API development
cask "postman"
# Kubernetes and container management on the desktop
cask "rancher"
# Control your tools with a few keystrokes
cask "raycast"
# MySQL/MariaDB database management
cask "sequel-ace"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Team communication and collaboration software
cask "slack"
# CLI to create, run, and deploy Slack apps
cask "slack-cli"
# Native GUI tool for relational databases
cask "tableplus"
# Pluggable Terraform linter
cask "terraform-linters/tap/tflint", trusted: true
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
